{
  "about": "Anhui Jianghuai Yinlian Heavy Construction Machinery Co., Ltd.   (hereinafter referred to as Jianghuai heavy industry) is a subsidiary of Anhui    Jianghuai Automobile Group Holding Co., Ltd. (hereinafter referred to as Jianghuai Automobile),    a large domestic automobile group com­ pany. Thecompany specializes in the R & D,   manufacturing and sales of various counterv.,eight forklifts,electric storage vehicles   and intelligent logistics AGV products. Hefei mining machinery factory, the predecessor   of the company, is the only enterprise that has won two gold medals   in China. It has a history of more than 50 years of R & D and manufacturing of construction ma­   chinery, and is known as the cradle of China's construction machinery.   At present, the company has more than 400 employees,    covering an area of 200 mu, with a construction area of more than 50000 square meters,   and an annual pro­ duction capacity of 20000 forklifts of various types.   II has Toshiba CNC machining center, five cutting flame CNC flame cutting machine,   laser cutting machine and plasma cutting machine, automatic welding robot,   kiloton hydraulic machine, shot blasting machine, automatic coating line,    gantry assembly line, vehicle assembly line,   CMM, engine test bench, gantry test bench, hydraulic comprehensive test bench,    speed test bench, brake test bench and standard test field And other production,    testing equipment 550 sets.",
  
  "morebtn": "More Detail",
  "detailBtn": "Specifications",
  "deselF":"Dessel",
  "electF":"Electric",
  "loading":"loading...wait please",
  "dezel": "Diesel Forklift",
  "electric": "Electric Forklift",
  "email":"E-mail",
  "name":"Name",
  "company":"Company",
  "phone":"Phone",
  "whatsApp":"WhatsApp",
  "msg":"Message",
  "sendBtn":"Send",
  "footerData":"Saeed AlKhuraimi Trading Ees  is the exclusive dealer of JAC vehicles in the Kingdom of Saudi Arabia. Through our extensive network, we provide a superior dealership experience.",
  "contactInfo":"PO.BOX :6164   Zip Code : 21442 : Telephone  +966126604549  Mobile : +966505622380",
  "engine":"Engine"
  
}

 








